app/controllers/authorization_periods_controller.rb

SELECT * FROM "authorization_periods"
---
  def index
    @authorization_periods = AuthorizationPeriod.all

SELECT * FROM "authorization_periods" WHERE ("authorization_periods"."id" = 1)
---
  def show
    @authorization_period = AuthorizationPeriod.find(params[:id])

INSERT INTO "authorization_periods" ("created_at", "updated_at", "from_date", "to_date") VALUES('2011-03-08 13:35:04', '2011-03-08 13:35:04', '2011-01-08 13:34:00', '2011-02-08 13:34:00')
---
  def create
    @authorization_period = AuthorizationPeriod.new(params[:authorization_period])

    respond_to do |format|
      if @authorization_period.save

SELECT * FROM "authorization_periods" WHERE ("authorization_periods"."id" = 2)
SELECT * FROM "visits" WHERE ("visits"."authorization_id" = 1)
DELETE FROM "authorization_periods" WHERE "id" = 2
---
  def destroy
    @authorization_period = AuthorizationPeriod.find(params[:id])
#check if there are any visits with this patient before deleting
		@visit = Visit.find_all_by_authorization_id(@authorization_period)
		if @visit.empty?
    	@authorization_period.destroy