app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT * FROM "patients"

  def show
    @patient = Patient.find(params[:id])
---
SELECT * FROM "patients" WHERE ("patients"."id" = 1)

  def edit
    @patient = Patient.find(params[:id])
---
SELECT * FROM "patients" WHERE ("patients"."id" = 2)

  def create
    @patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("city", "zip", "created_at", "updated_at", "address_1", "number_of_visits", "last_name", "address_2", "phone", "first_name", "middle_name", "state") VALUES('Maxton', 28364, '2011-03-02 15:47:35', '2011-03-02 15:47:35', '2774 Hezidiah Rd.', 22, 'Locklear', '', '9105214455', 'Deletha', '', 'NC')

  def update
    @patient = Patient.find(params[:id])

    respond_to do |format|
      if @patient.update_attributes(params[:patient])
---
SELECT * FROM "patients" WHERE ("patients"."id" = 25)
UPDATE "patients" SET "updated_at" = '2011-03-09 15:09:31', "address_1" = '334 Prospect Rd.' WHERE "id" = 1

  def destroy
  	@patient = Patient.find(params[:id])
#check if there are any visits with this patient before deleting
		if @patient.visits.empty?
    	@patient.destroy
---
SELECT * FROM "patients" WHERE ("patients"."id" = 2)
SELECT * FROM "patients" LIMIT 1
SELECT * FROM "visits" WHERE ("visits"."patient_id" IS NULL)
SELECT count(*) AS count_all FROM "visits" WHERE ("visits".patient_id = 1)
DELETE FROM "patients" WHERE "id" = 2