app/controllers/sites_controller.rb

SELECT * FROM "sites"
---
  def index
    @sites = Site.all

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def show
    @site = Site.find(params[:id])

INSERT INTO "sites" ("created_at", "updated_at", "site_name") VALUES('2011-03-09 17:55:06', '2011-03-09 17:55:06', 'Prospect School')
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save