app/controllers/therapists_controller.rb

SELECT * FROM "therapists"
---
  def index
    @therapists = Therapist.all

SELECT * FROM "therapists" WHERE ("therapists"."id" = 1)
---
  def show
    @therapist = Therapist.find(params[:id])

SELECT * FROM "therapists" WHERE ("therapists"."id" = 1)
---
  def edit
    @therapist = Therapist.find(params[:id])

INSERT INTO "therapists" ("city", "zip", "created_at", "updated_at", "address_1", "last_name", "address_2", "phone", "first_name", "middle_name", "state") VALUES('Maxton', 28364, '2011-03-02 15:46:47', '2011-03-02 15:46:47', '2778 Hezekiah Rd.', 'Dial', '', '9105223344', 'Faline', 'Locklear', 'NC')
---
  def create
    @therapist = Therapist.new(params[:therapist])

    respond_to do |format|
      if @therapist.save

SELECT * FROM "therapists" WHERE ("therapists"."id" = 1)
UPDATE "therapists" SET "updated_at" = '2011-03-09 15:10:05', "address_1" = '2778 Hezekiah Rd.' WHERE "id" = 1
---
  def update
    @therapist = Therapist.find(params[:id])

    respond_to do |format|
      if @therapist.update_attributes(params[:therapist])

SELECT * FROM "therapists" WHERE ("therapists"."id" = 2)
SELECT * FROM "visits" WHERE ("visits"."therapist_id" = 1)
SELECT count(*) AS count_all FROM "visits" WHERE ("visits".therapist_id = 1)
DELETE FROM "therapists" WHERE "id" = 2
---
  def destroy
    @therapist = Therapist.find(params[:id])
#check if there are any visits with this therapist before deleting
		if @therapist.visits.empty?
    	@therapist.destroy