app/controllers/visits_controller.rb

SELECT * FROM "visits"
---
  def index
    @visits = Visit.all

SELECT * FROM "visits" WHERE ("visits"."id" = 1)
---
  def show
    @visit = Visit.find(params[:id])

SELECT * FROM "visits" WHERE ("visits"."id" = 2)
---
  def edit
    @visit = Visit.find(params[:id])

INSERT INTO "visits" ("created_at", "visit_date", "updated_at", "therapist_id", "visit_notes", "patient_id", "authorization_id", "session_length") VALUES('2011-03-08 13:51:56', '2011-03-08 13:51:00', '2011-03-08 13:51:56', 6, 'Test notes', 3, NULL, '35')
---
  def create
    @visit = Visit.new(params[:visit])

    respond_to do |format|
      if @visit.save

SELECT * FROM "visits" WHERE ("visits"."id" = 2)
UPDATE "visits" SET "updated_at" = '2011-03-09 19:23:31', "visit_notes" = 'Test notes', "session_length" = '35' WHERE "id" = 6
---
  def update
    @visit = Visit.find(params[:id])

    respond_to do |format|
      if @visit.update_attributes(params[:visit])

SELECT * FROM "visits" WHERE ("visits"."id" = 1)
DELETE FROM "visits" WHERE "id" = 1
---
  def destroy
    @visit = Visit.find(params[:id])
    @visit.destroy